mahdy-asady/STM32-FUOTA/src/app/bootloader/main.c
#include <stdint.h>
#include <string.h>
#include <stdbool.h>

#include "stm32f107xc.h"
#include "board.h"
#include "USART.h"
#include "ESP-AT.h"
#include "debug.h"
#include "timer.h"
#include "fuota.h"
#include "bkpreg.h"
#include "newstring.h"

extern char FLASH_APP1_OFFSET;

USART_Handle UsartDebug;
USART_Handle UsartWebConn;

void BootApplication(void);
void UsartInit(void);


int main(void) {

    ShowBootloaderSign();

    UsartInit();
    
    log_info(&UsartDebug, "Boot loader Started!");
    
    BackupRegInit();

    uint16_t Data = BackupRegRead(0);
    char tmp[20];
    Num2Str(Data, tmp);
    log_info(&UsartDebug, tmp);

    BackupRegWrite(0, 0xFAFA);
    
    Data = BackupRegRead(0);
    Num2Str(Data, tmp);
    log_info(&UsartDebug, tmp);


    ESP_Init(&UsartWebConn, &UsartDebug);
    ESP_WifiConnect(WIFI_SSID, WIFI_PASS);

    FUOTA_Update();

    log_info(&UsartDebug, "Done!!!");

    //BootApplication();

    while(1);
}


void SystemInit(void) {
    SystemClockSetup();
    TimerInit();
}

void UsartInit(void) {
    UsartDebug.Instance = USART1;
    UsartDebug.BaudRate = 40 << 4;
    UsartDebug.isPortMapped = 0;
    USART_Init(&UsartDebug);
    
    UsartWebConn.Instance = USART2;
    UsartWebConn.BaudRate = 20 << 4;
    UsartWebConn.isPortMapped = 1;
    USART_Init(&UsartWebConn);
}

void BootApplication(void) {
    void (*AppResetHandler)(void) = (void*)(*((volatile uint32_t*) (&FLASH_APP1_OFFSET + 4U)));

    //Set Vector Table
    SCB->VTOR = (uint32_t)&FLASH_APP1_OFFSET;
    // Set stack pointer
    __set_MSP((uint32_t)*((__IO uint32_t*)&FLASH_APP1_OFFSET));
    //Run Application's ResetHandler
    AppResetHandler();
}
